# Оценка повышения уровня благополучия детей по всему миру

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from itertools import combinations
from scipy.stats import ttest_ind

In [2]:
pd.set_option('display.max_rows', 50)  # показывать больше строк
pd.set_option('display.max_columns', 50)  # показывать больше столбцов

In [3]:
df = pd.read_csv('./stud_math.csv')

In [4]:
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,traveltime,studytime,failures,schoolsup,famsup,paid,activities,nursery,"studytime, granular",higher,internet,romantic,famrel,freetime,goout,health,absences,score
0,GP,F,18,U,NaN,A,4.0,4.0,at_home,teacher,course,mother,2.0,2.0,0.0,yes,no,no,no,yes,-6.0,yes,NaN,no,4.0,3.0,4.0,3.0,6.0,30.0
1,GP,F,17,U,GT3,NaN,1.0,1.0,at_home,other,course,father,1.0,2.0,0.0,no,yes,no,no,no,-6.0,yes,yes,no,5.0,3.0,3.0,3.0,4.0,30.0
2,GP,F,15,U,LE3,T,1.0,1.0,at_home,other,other,mother,1.0,2.0,3.0,yes,no,NaN,no,yes,-6.0,yes,yes,NaN,4.0,3.0,2.0,3.0,10.0,50.0
3,GP,F,15,U,GT3,T,4.0,2.0,health,NaN,home,mother,1.0,3.0,0.0,no,yes,yes,yes,yes,-9.0,yes,yes,yes,3.0,2.0,2.0,5.0,2.0,75.0
4,GP,F,16,U,GT3,T,3.0,3.0,other,other,home,father,1.0,2.0,0.0,no,yes,yes,no,yes,-6.0,yes,no,no,4.0,3.0,2.0,5.0,4.0,50.0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 30 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   school               395 non-null    object
 1   sex                  395 non-null    object
 2   age                  395 non-null    int64
 3   address              378 non-null    object
 4   famsize              368 non-null    object
 5   Pstatus              350 non-null    object
 6   Medu                 392 non-null    float64
 7   Fedu                 371 non-null    float64
 8   Mjob                 376 non-null    object
 9   Fjob                 359 non-null    object
 10  reason               378 non-null    object
 11  guardian             364 non-null    object
 12  traveltime           367 non-null    float64
 13  studytime            388 non-null    float64
 14  failures             373 non-null    float64
 15  schoolsup            386 non-null    object
 16  famsup               356 non-null    object
 17  paid                 355 non-null    object
 18  activities           381 non-null    object
 19  nursery              379 non-null    object
 20  studytime, granular  388 non-null    float64
 21  higher               375 non-null    object
 22  internet             361 non-null    object
 23  romantic             364 non-null    object
 24  famrel               368 non-null    float64
 25  freetime             384 non-null    float64
 26  goout                387 non-null    float64
 27  health               380 non-null    float64
 28  absences             383 non-null    float64
 29  score                389 non-null    float64
dtypes: float64(12), int64(1), object(17)
memory usage: 92.7+ KB

In [6]:
df.drop(['studytime, granular'], inplace=True, axis=1)

In [7]:
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,traveltime,studytime,failures,schoolsup,famsup,paid,activities,nursery,higher,internet,romantic,famrel,freetime,goout,health,absences,score
0,GP,F,18,U,NaN,A,4.0,4.0,at_home,teacher,course,mother,2.0,2.0,0.0,yes,no,no,no,yes,yes,NaN,no,4.0,3.0,4.0,3.0,6.0,30.0
1,GP,F,17,U,GT3,NaN,1.0,1.0,at_home,other,course,father,1.0,2.0,0.0,no,yes,no,no,no,yes,yes,no,5.0,3.0,3.0,3.0,4.0,30.0
2,GP,F,15,U,LE3,T,1.0,1.0,at_home,other,other,mother,1.0,2.0,3.0,yes,no,NaN,no,yes,yes,yes,NaN,4.0,3.0,2.0,3.0,10.0,50.0
3,GP,F,15,U,GT3,T,4.0,2.0,health,NaN,home,mother,1.0,3.0,0.0,no,yes,yes,yes,yes,yes,yes,yes,3.0,2.0,2.0,5.0,2.0,75.0
4,GP,F,16,U,GT3,T,3.0,3.0,other,other,home,father,1.0,2.0,0.0,no,yes,yes,no,yes,yes,no,no,4.0,3.0,2.0,5.0,4.0,50.0

## functions:

In [8]:
def get_statistic(column):
    median = df[column].median()
    perc25 = df[column].quantile(q=0.25)
    perc75 = df[column].quantile(q=0.75)
    IQR = perc75 - perc25

    print(
        '25-й перцентиль: {},'.format(perc25),
        '75-й перцентиль: {},'.format(perc75), 
        'IQR: {}, '.format(IQR),
        'Границы выбросов: [{f}, {l}].'.format(f=perc25 - 1.5*IQR, l=perc75 + 1.5*IQR)
    )
    
    return median, perc25, perc75, IQR


def filter_statistical_outliers(df, column):
    return df[
        df[column].isin(
            df[column].value_counts()[
                df[column].value_counts() > 10
            ].index
        )
    ]


def show_grouped_info(column):
    display(pd.DataFrame(df[column].value_counts()))
    df.loc[:, [column]].info()

## school

In [9]:
show_grouped_info('school')

    school
GP     349
MS      46

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   school  395 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

Данные чистые, нет пустых значений.

## sex

In [10]:
show_grouped_info('sex')

   sex
F  208
M  187

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sex     395 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

Данные чистые, нет пустых значений.

## age

In [11]:
show_grouped_info('age')

    age
16  104
17   98
18   82
15   82
19   24
20    3
22    1
21    1

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     395 non-null    int64
dtypes: int64(1)
memory usage: 3.2 KB

Данные чистые, нет пустых значений. В сгруппированном виде видно что количество данных в возрастной категории [20, 21, 22] очень низкое. Возможно будет целесообразно исключить возрастные категории [20, 21, 22]

## address

In [12]:
show_grouped_info('address')

   address
U      295
R       83

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   address  378 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

## famsize

In [13]:
show_grouped_info('famsize')

     famsize
GT3      261
LE3      107

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   famsize  368 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

## Medu

In [14]:
show_grouped_info('Medu')

     Medu
4.0   131
2.0   102
3.0    97
1.0    59
0.0     3

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Medu    392 non-null    float64
dtypes: float64(1)
memory usage: 3.2 KB

## Fedu

In [15]:
show_grouped_info('Fedu')

      Fedu
2.0    106
3.0     96
4.0     88
1.0     78
0.0      2
40.0     1

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fedu    371 non-null    float64
dtypes: float64(1)
memory usage: 3.2 KB

## Mjob

In [16]:
show_grouped_info('Mjob')

          Mjob
other      133
services    98
at_home     58
teacher     55
health      32

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Mjob    376 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

## Fjob

In [17]:
show_grouped_info('Fjob')

          Fjob
other      197
services   102
teacher     29
at_home     16
health      15

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fjob    359 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

## reason

In [18]:
show_grouped_info('reason')

            reason
course         137
home           104
reputation     103
other           34

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   reason  378 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

## guardian

In [19]:
show_grouped_info('guardian')

        guardian
mother       250
father        86
other         28

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   guardian  364 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

## traveltime

In [20]:
show_grouped_info('traveltime')

     traveltime
1.0         242
2.0          96
3.0          22
4.0           7

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   traveltime  367 non-null    float64
dtypes: float64(1)
memory usage: 3.2 KB

## studytime

In [21]:
show_grouped_info('studytime')

     studytime
2.0        194
1.0        103
3.0         64
4.0         27

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   studytime  388 non-null    float64
dtypes: float64(1)
memory usage: 3.2 KB

## failures

In [22]:
show_grouped_info('failures')

     failures
0.0       293
1.0        49
2.0        16
3.0        15

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   failures  373 non-null    float64
dtypes: float64(1)
memory usage: 3.2 KB

## schoolsup

In [23]:
show_grouped_info('schoolsup')

     schoolsup
no         335
yes         51

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   schoolsup  386 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

## famsup

In [24]:
show_grouped_info('famsup')

     famsup
yes     219
no      137

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   famsup  356 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

## paid

In [25]:
show_grouped_info('paid')

     paid
no    200
yes   155

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   paid    355 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

## activities

In [26]:
show_grouped_info('activities')

     activities
yes         195
no          186

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   activities  381 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

## nursery

In [27]:
show_grouped_info('nursery')

     nursery
yes      300
no        79

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   nursery  379 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

## higher

In [28]:
show_grouped_info('higher')

     higher
yes     356
no       19

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   higher  375 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

## internet

In [29]:
show_grouped_info('internet')

     internet
yes       305
no         56

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   internet  361 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

## romantic

In [30]:
show_grouped_info('romantic')

     romantic
no        240
yes       124

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   romantic  364 non-null    object
dtypes: object(1)
memory usage: 3.2+ KB

## famrel

In [31]:
show_grouped_info('famrel')

      famrel
 4.0     182
 5.0      99
 3.0      62
 2.0      17
 1.0       7
-1.0       1

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   famrel  368 non-null    float64
dtypes: float64(1)
memory usage: 3.2 KB

В описание таблицы сказанно что значение столбца **famrel** должно быть от 1 >= n <= 5, поэтому удалим невалидное значение

In [32]:
df = df[df['famrel'] > 0]

In [33]:
show_grouped_info('famrel')

     famrel
4.0     182
5.0      99
3.0      62
2.0      17
1.0       7

<class 'pandas.core.frame.DataFrame'>
Int64Index: 367 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   famrel  367 non-null    float64
dtypes: float64(1)
memory usage: 5.7 KB

## freetime

In [34]:
show_grouped_info('freetime')

     freetime
3.0       141
4.0       105
2.0        58
5.0        36
1.0        17

<class 'pandas.core.frame.DataFrame'>
Int64Index: 367 entries, 0 to 394
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   freetime  357 non-null    float64
dtypes: float64(1)
memory usage: 5.7 KB

## goout

In [35]:
show_grouped_info('goout')

     goout
3.0    120
2.0     94
4.0     77
5.0     48
1.0     20

<class 'pandas.core.frame.DataFrame'>
Int64Index: 367 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   goout   359 non-null    float64
dtypes: float64(1)
memory usage: 5.7 KB

## health

In [36]:
show_grouped_info('health')

     health
5.0     120
3.0      87
4.0      60
1.0      43
2.0      42

<class 'pandas.core.frame.DataFrame'>
Int64Index: 367 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   health  352 non-null    float64
dtypes: float64(1)
memory usage: 5.7 KB

## absences

In [37]:
show_grouped_info('absences')

       absences
0.0         100
2.0          57
4.0          52
6.0          29
8.0          21
10.0         15
12.0         12
14.0         10
3.0           8
16.0          7
7.0           6
5.0           5
18.0          4
20.0          3
22.0          3
15.0          2
9.0           2
1.0           2
25.0          1
17.0          1
11.0          1
23.0          1
40.0          1
38.0          1
19.0          1
54.0          1
30.0          1
21.0          1
26.0          1
56.0          1
24.0          1
28.0          1
212.0         1
13.0          1
385.0         1

<class 'pandas.core.frame.DataFrame'>
Int64Index: 367 entries, 0 to 394
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   absences  355 non-null    float64
dtypes: float64(1)
memory usage: 5.7 KB

Отфильруем данные и отобразим лишь те, где количество сгруппированных данных больше 10

In [38]:
# df = filter_statistical_outliers(df, 'absences')

## score

In [39]:
show_grouped_info('score')

       score
50.0      52
55.0      44
0.0       34
60.0      30
75.0      29
65.0      29
40.0      28
70.0      23
45.0      23
80.0      16
30.0      15
90.0      12
35.0       9
85.0       6
25.0       5
95.0       4
100.0      1
20.0       1

<class 'pandas.core.frame.DataFrame'>
Int64Index: 367 entries, 0 to 394
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   score   361 non-null    float64
dtypes: float64(1)
memory usage: 5.7 KB

In [40]:
df['score'].describe()

count    361.000000
mean      52.368421
std       22.846103
min        0.000000
25%       40.000000
50%       55.000000
75%       70.000000
max      100.000000
Name: score, dtype: float64

Отфильруем данные и отобразим лишь те, где количество сгруппированных данных больше 10

In [41]:
pd.DataFrame(filter_statistical_outliers(df, 'score')['score'].value_counts())

      score
50.0     52
55.0     44
0.0      34
60.0     30
65.0     29
75.0     29
40.0     28
70.0     23
45.0     23
80.0     16
30.0     15
90.0     12